Repository: 84000/data-translation-memory
Catalog: toh54-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཀུན་ནས་སྒོའི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Exposition on the Universal Gateway

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་བརྒྱད་བརྒྱའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བཞི་ཁྲི་ཉིས་སྟོང་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ
en: The Blessed One was staying at Vulture Peak Mountain by Rājagṛha, together with a great saṅgha of eight hundred monks, and with forty-two thousand bodhisattvas.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དྲི་མ་མེད་པའི་སྙིང་པོ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་དགུ་ཁྲི་ཉིས་སྟོང་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་ཀུན་དུ་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་སྤྱོད་པ་ཡོངས་སུ་དག་པ་དང་ལྡན་པ་ནས་
en: At that time, a bodhisattva great being by the name Amalagarbha, accompanied by ninety-two thousand other bodhisattvas, set out from the world known as Immaculate Conduct—the buddhafield of the thus-gone, worthy, perfect buddha Saṃkusumita.

source: འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིའི་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ག་ལ་བ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེར་སོང་ངོ་། །
en: They traveled to Vulture Peak Mountain, here in this Sahā world, where the blessed, thus-gone, worthy, perfect buddha Śākyamuni dwelled.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དྲི་མ་མེད་པའི་སྙིང་པོ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོས་ཡོངས་སུ་བསྐོར་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་མདུན་དུ་བདར་ནས་ནམ་མཁའ་ལས་འོང་བར་བཅོམ་ལྡན་འདས་ཀྱིས་གཟིགས་སོ། །
en: As the bodhisattva great being Amalagarbha arrived in the sky, surrounded and attended by a great assembly of bodhisattvas, the Blessed One noticed him.

source: གཟིགས་ནས་ཀྱང་བཅོམ་ལྡན་འདས་འདི་སྙམ་དུ་དགོངས་ཏེ།
en: As he caught sight of him, the Blessed One thought,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དྲི་མ་མེད་པའི་སྙིང་པོ་འདི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་ཀུན་དུ་རྒྱས་པས་ཀུན་ནས་སྒོའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་དག་པར་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་འདིར་འོང་བར་གནང་སྟེ་བཏང་གིས།
en: “The bodhisattva great being Amalagarbha has been dispatched here by the thus-gone, worthy, perfect buddha Saṃkusumita in order to receive the Dharma teaching called The Exposition on the Universal Gateway.

source: ངས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དག་བསྡུ་བར་བྱ་བར་ངེས་སོ་སྙམ་དུ་དགོངས་སོ། །
en: Therefore, I, for my part, should gather the bodhisattvas.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ་དེ་ལྟ་བུ་དགོངས་ནས་དེས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་འཁོད་པ་དེ་དག་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིའི་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ག་ལ་བ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ལྷགས་སོ། །
en: Then, because the Blessed One formed this intent, all bodhisattva great beings residing in boundless, infinite worlds arrived at Vulture Peak Mountain here in this Sahā world to meet the Blessed One.

source: ལྷགས་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Upon arrival, they bowed their heads to the Blessed One’s feet and sat down to one side.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་འདུས་སོ། །
en: All the bodhisattva great beings at Vulture Peak Mountain who had retired for meditation also gathered.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དྲི་མ་མེད་པའི་སྙིང་པོ་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་པད་མ་འདབ་མ་སྟོང་དང་ལྡན་པ་ཐོགས་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་།
en: The bodhisattva great being Amalagarbha then went before the thus-gone, worthy, perfect buddha Śākyamuni, holding a thousand-petaled lotus flower made of the seven precious substances.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ
en: He bowed his head to the Blessed One’s feet and

source: པད་མ་འདབ་མ་སྟོང་དང་ལྡན་པ་དེ་ཕུལ་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: offered him the thousand-petaled lotus. Amalagarbha then said to the Blessed One,

source: བཅོམ་ལྡན་འདས་འཇིག་རྟེན་གྱི་ཁམས་སྤྱོད་པ། ཡོངས་སུ་དག་པ་དང་ལྡན་པ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་ཀུན་དུ་རྒྱས་པ་བཅོམ་ལྡན་འདས་ལ་སྙུན་གསོལ་ཏེ།
en: “Blessed One, the thus-gone, worthy, perfect buddha Saṃkusumita from the world Immaculate Conduct inquiries about the Blessed One’s health.

source: གནོད་པ་ཆུང་ངམ། ཉམ་ང་བ་ཉུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། འཚོ་འམ།
en: Does the Blessed One have but little trouble, grief, and agitation?

source: སྟོབས་དང་ལྡན་པར་བདེ་བ་ལ་རེག་པར་གནས་སམ།
en: Is he in good health, strong, and at ease?

source: བཅོམ་ལྡན་འདས་ལ་སྙུན་མི་མངའ་འམ། གནོད་པ་ཆུང་ངམ་ཞེས་སྙུན་གསོལ་ཞིང་
en: Is the Blessed One free of illness and does he have but few troubles?”

source: འདི་སྐད་ཅེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཀུན་ནས་སྒོའི་ལེའུ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་སྟོན་ཏམ་ཞེས་ཀྱང་གསུང་ངོ་། །
en: When he had thus inquired after the Blessed One’s health, he added, “Might the blessed, thus-gone, worthy, perfect buddha Śākyamuni deliver the Dharma teaching pertaining to the inconceivable Exposition on the Universal Gateway to the bodhisattva great beings?”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དྲི་མ་མེད་པའི་སྙིང་པོས་བཅོམ་ལྡན་འདས་ལ་རྣམ་པ་དེ་དག་གསོལ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་འཁོར་དང་བཅས་ཏེ་ནམ་མཁའ་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་འདུག་གོ །
en: Then, having asked the Blessed One in this way, the bodhisattva great being Amalagarbha sat down cross-legged in the sky in the midst of his retinue of bodhisattvas.

source: ཡང་དེའི་ཚེ་ན་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་གོ །
en: At that time, Prince Mañjuśrī was also present within that assembly.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ཏེ།
en: He rose from his seat,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: draped his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Joining his palms, he bowed toward the Blessed One and said,

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རྗེས་སུ་བཟུང་བའི་སླད་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཀུན་ནས་སྒོའི་ལེའུ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེགས་པར་བཤད་དུ་གསོལ།
en: “In order to foster the bodhisattvas, I request the Blessed One, the Thus-Gone One, to thoroughly expound the Dharma teaching pertaining to the inconceivable Exposition on the Universal Gateway.

source: བཅོམ་ལྡན་འདས་བདག་གིས་མངོན་པར་འཚལ་ཏེ།
en: Blessed One, I beseech you.

source: འདས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་དུ་སྣང་བའི་སྒྲོན་མ་ལས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་ཏིང་ངེ་འཛིན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་བསྐྱེད་པར་གྱུར།
en: In the past, I received this teaching from the thus-gone, worthy, perfect buddha Bright Lamp and thereby developed eighty-four sextillion absorptions.

source: གཟུངས་སྒྲུབ་པའི་སྒོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་བདུན་ཡང་རྟོགས་པར་གྱུར་ཏོ། །
en: I also understood seventy-seven sextillion approaches to accomplishing dhāraṇīs.

source: དེ་ལྟ་ལགས་པས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རྗེས་སུ་གཟུང་བའི་སླད་དུ་ལེགས་པར་བཤད་དུ་གསོལ།
en: That being the case, may the Blessed One also teach this thoroughly in order to foster these bodhisattvas.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: In response, the Blessed One said the following to Prince Mañjuśrī:

source: དེའི་ཕྱིར་འཇམ་དཔལ་ཁྱོད་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ། །
en: “To this effect, Mañjuśrī, listen carefully and keep in mind what I explain.”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ། །ཞེས་གསོལ་ཏེ།
en: Prince Mañjuśrī answered, “Blessed One, so be it.”

source: བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: He listened closely as the Blessed One said,

source: འཇམ་དཔལ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, bodhisattva great beings should understand form to be absorption.

source: སྒྲ་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand sound to be absorption.

source: དྲི་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand scent to be absorption.

source: རོ་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand taste to be absorption.

source: རེག་བྱ་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand tactile objects to be absorption.

source: ཡིད་ཀྱི་ཁམས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand the objects of the mind to be absorption.

source: བུད་མེད་ཀྱི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “They should understand women’s figures to be absorption.

source: སྐྱེས་པའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand men’s figures to be absorption.

source: ཁྱེའུའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand boys’ figures to be absorption.

source: བུ་མོའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand girls’ figures to be absorption.

source: ལྷའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand the gods’ figures to be absorption.

source: ཀླུའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand the nāgas’ figures to be absorption.

source: གནོད་སྦྱིན་གྱི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand the yakṣas’ figures to be absorption.

source: དྲི་ཟའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand the gandharvas’ figures to be absorption.

source: ལྷ་མ་ཡིན་གྱི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand the asuras’ figures to be absorption.

source: ནམ་མཁའ་ལྡིང་གི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand the garuḍas’ figures to be absorption.

source: མི་འམ་ཅིའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand the kinnaras’ figures to be absorption.

source: ལྟོ་འཕྱེ་ཆེན་པོའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand the mahoragas’ figures to be absorption.

source: སེམས་ཅན་དམྱལ་བའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand the hell beings’ figures to be absorption.

source: དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand animals’ figures to be absorption.

source: གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand the figures of beings in the world of the Lord of Death to be absorption.

source: འདོད་ཆགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “They should understand attachment to be absorption.

source: ཞེ་སྡང་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand anger to be absorption.

source: གཏི་མུག་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand ignorance to be absorption.

source: དགེ་བ་ཐམས་ཅད་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand all virtues to be absorption.

source: མི་དགེ་བ་ཐམས་ཅད་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand all nonvirtues to be absorption.

source: འདུས་བྱས་ཐམས་ཅད་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand all conditioned phenomena to be absorption.

source: འདུས་མ་བྱས་ཐམས་ཅད་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: They should understand all unconditioned phenomena to be absorption.

source: དེ་ལྟར་ཆོས་ཐམས་ཅད་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་སྟེ།
en: In this manner, they should understand all phenomena to be absorption.

source: འཇམ་དཔལ་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཐམས་ཅད་དུ་འགྲོ་བའི་བློ་དང་ལྡན་པ་ཡིན་ལ་ཀུན་ནས་སྒོའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་ལ་ཡང་བསླབས་པ་ཡིན་ནོ། །
en: Mañjuśrī, bodhisattva great beings who obtain all such absorptions have omnipresent minds and are trained in the Dharma teaching of The Exposition on the Universal Gateway.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, in this regard, how should bodhisattvas understand form to be absorption?

source: གཟུགས་ནི་དབུ་བ་ལྟ་བུར་གསུངས། དེ་ལ་སྙིང་པོ་མི་རྙེད་དོ། །
en: “Form is said to be like a bubble: Its essence cannot be found.

source: སྙིང་པོ་མེད་ཕྱིར་གཟུང་མེད་ཕྱིར། །དེས་ན་ཏིང་ངེ་འཛིན་ཅེས་བསྟན། །
en: Since it is essenceless and cannot be grasped, I have taught it to be absorption.

source: འཇམ་དཔལ་དེ་ལྟར་ན་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how one should understand form to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་སྒྲ་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, in this regard, how should bodhisattvas understand sound to be absorption?

source: སྒྲ་ནི་བྲག་ཆ་ལྟ་བུ་སྟེ།
en: “Sound is like an echo:

source: དེ་ལ་དངོས་པོ་ཡོད་མ་ཡིན། །
en: It has no substance.

source: ཐ་དད་དབྱེ་བ་མེད་ཤེས་ཤིང་། །
en: I know it to have no distinguishable parts

source: མཚན་ཉིད་མེད་པར་བྱེ་བྲག་མེད། །
en: And to be devoid of characteristics, with no particularities.

source: མཚན་ཉིད་མེད་ཅིང་བྱུང་བ་མེད། །
en: “It has no characteristics or origin,

source: ཡ་མ་བརླ་དང་འདུས་མ་བྱས། །བྲག་ཆ་ལྟ་བུར་ཤེས་པ་ན། །
en: And is hollow and unconditioned. Knowing it to be like an echo,

source: དེས་ན་ཏིང་ངེ་འཛིན་ཅེས་བསྟན། །
en: I have taught it to be absorption.

source: འཇམ་དཔལ་དེ་ལྟར་ན་སྒྲ་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, that is how you should understand sound to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་དྲི་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, how should bodhisattvas understand scent to be absorption?

source: ཇི་ལྟར་རྒྱ་མཚོའི་གཏིང་དག་ནི། །ནམ་ཡང་ཅིས་ཀྱང་གང་མེད་ལྟར། །
en: “Just as the bottom of the ocean Can never be reached in any way,

source: བསྐལ་པ་བྱེ་བར་བསྣམས་བྱས་ཀྱང་། །སྣ་ནི་ཚིམ་པར་འགྱུར་བ་མེད། །
en: You could smell for ten million eons, But there would still be no satisfying the nose.

source: སྣ་ཡི་རྣམ་རིག་གཟུང་མེད་དེ། །
en: “The olfactory cognition cannot be apprehended;

source: སླུ་བའི་ཆོས་དེ་ཡོད་མ་ཡིན། །
en: It is deceiving and nonexistent.

source: གལ་ཏེ་ཡང་དག་ཡིན་གྱུར་ན། །
en: Were it to be real,

source: དེ་ལས་མྱུར་དུ་ཚིམ་པར་འགྱུར། །
en: It could rapidly be contented.

source: གཟུང་བ་མེད་ཅིང་ཡང་དག་མིན། །
en: “Since it is imperceptible and unreal,

source: སྣ་ཡང་ཡོད་མིན་གསོག་ཏུ་ཤེས། །
en: The nose is known to be nonexistent and hollow.

source: གསོབ་དང་སྟོང་བར་ཤེས་པས་ན། །
en: Knowing it to be void and empty,

source: འཇམ་དཔལ་དེ་ལྟར་ན་དྲི་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand scent to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་རོ་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, how should bodhisattvas understand taste to be absorption?

source: ལྕེ་ནི་ཚ་དང་ཁ་བའང་མིན། །
en: “The tongue is neither pungent nor bitter;

source: སྐྱུར་དང་ལན་ཚྭ་འང་མ་ཡིན་ཏེ། །
en: It is neither sour nor salty.

source: ཅི་འདྲའི་རྐྱེན་དང་ལྡན་པ་ལས། །ལྕེ་ཡང་དེ་དང་འདྲ་བར་འགྱུར། །
en: The tongue just changes in accordance With the conditions it encounters.

source: རོ་འདི་རྒྱུ་ལས་བྱུང་བ་དང་། །རྐྱེན་ལས་རག་ལས་ཤེས་གྱུར་ཅིང་། །
en: Taste is known to arise through causes And in dependence on conditions.

source: བསམ་གྱིས་མི་ཁྱབ་ཤེས་པས་ན། །དེས་ན་ཏིང་ངེ་འཛིན་ཅེས་བསྟན། །
en: Knowing it to be inconceivable, I have taught it to be absorption.

source: འཇམ་དཔལ་དེ་ལྟར་ན་རོ་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand taste to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་རེག་བྱ་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, how should bodhisattvas understand tactile objects to be absorption?

source: རྣམ་རིག་ལས་བྱུང་རེག་བྱ་ནི། །ངོ་བོ་ཉིད་ཀྱིས་ཡོད་མ་ཡིན། །
en: “Tactile objects, which arise out of cognition, Are not inherently existent.

source: འཇམ་པ་དང་ནི་རྩུབ་པ་ཉིད། །རྐྱེན་རྣམས་ལས་ནི་བྱུང་བ་ཡིན། །
en: Softness and roughness Are created by conditions.

source: རེག་བྱ་གནས་པ་མེད་པ་སྟེ། །
en: “Tactile objects are baseless;

source: བདག་མེད་ཉེ་བར་གནས་པ་ཡིན། །
en: Their way of abiding is devoid of self.

source: ཚོགས་རྣམས་སྦྱོར་བར་ཤེས་པས་ན། །
en: Knowing them to be a combination of composite factors,

source: འཇམ་དཔལ་དེ་ལྟར་ན་རེག་བྱ་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand tactile objects to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་ཡིད་ཀྱི་ཁམས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན། །
en: “Mañjuśrī, how should bodhisattvas understand objects of the mind to be absorption?

source: གང་དག་སྟོང་གསུམ་སེམས་ཅན་རྣམས། །དེ་དག་གནས་གཅིག་གནས་གྱུར་ཏེ། །
en: “Beings of the trichiliocosm All dwell in the same condition.

source: ཡིད་ཁམས་རྣམ་པར་ཤེས་བྱེད་ཀྱང་། །དེ་ཡི་དངོས་པོ་རྙེད་མི་འགྱུར། །
en: Though they cognize the range of mental objects, They cannot find their substance.

source: བསགས་པ་དང་ནི་གོང་བུ་ཡང་། །རྣམ་པར་རིག་ལ་གནས་པ་མེད། །
en: “That which is aggregated and amassed Has no basis in cognition.

source: ཁ་དོག་སྣ་ཚོགས་རྣམས་སྟོན་ཀྱང་། །ཕྱི་དང་ནང་ན་གནས་མ་ཡིན། །
en: Though cognition displays various colors, These exist neither outside nor inside.

source: གནས་པ་མེད་ཅིང་གནས་ཀྱང་མེད། །
en: “Mental objects do not abide and have no basis.

source: སྒྱུ་མ་ལྟ་བུར་དངོས་པོ་མེད། །
en: Like an illusion, they are insubstantial.

source: མེད་ཅིང་ཡ་མ་བརླར་ཤེས་པས། །དེས་ན་ཏིང་ངེ་འཛིན་ཅེས་བསྟན། །
en: Knowing them to be nonexistent and hollow, I have taught them to be absorption.

source: འཇམ་དཔལ་དེ་ལྟར་ན་ཡིད་ཀྱི་ཁམས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, that is how you should understand mental objects to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་བུད་མེད་ཀྱི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, how should bodhisattvas understand the female figure to be absorption?

source: འབྱུང་བ་ཆེན་པོ་བཞི་པོ་དག །དེ་ལ་བུད་མེད་ཡོད་མིན་ཡང་། །
en: “Though women do not exist Within the four major elements,

source: བྱིས་པ་རྣམས་ནི་རྨོངས་པའི་བློས། །འདོད་པའི་གསོག་ལ་སྤྱོད་པར་བྱེད། །
en: The immature, with their confused minds, Engage in trifling desires.

source: སྒྱུ་མའི་བུད་མེད་མཚན་མེད་ཀྱང་། །བུད་མེད་གཟུགས་སུ་སྣང་བ་ལ། །
en: “Though illusory women are without marks, They appear as the female figure.

source: གང་དག་མུན་པས་བསྒྲིབས་པའི་མི། །དེ་ལ་ཀུན་དུ་ཆགས་པ་སྐྱེད། །
en: Those men who are enclosed in darkness Give rise to strong attachment toward them.

source: ཇི་ལྟར་སྒྱུ་མའི་བུད་མེད་ལ། །འདོད་ཆགས་ལྡན་པའི་སེམས་བསྐྱེད་ཀྱང་། །དེ་ལ་བུད་མེད་ཡོད་མ་ཡིན། །
en: “While they give rise to desirous thoughts Regarding illusory women, These women are nonexistent.

source: ཕྱིན་ཅི་ལོག་གི་སེམས་ཀྱིས་ནི། །བསྐལ་པ་བྱེ་བ་གྲངས་མེད་དུ། །བློ་གྲོས་ཆུང་རྣམས་འཁོར་བར་བྱེད། །
en: “It is this mistaken mind That has made the simple-minded Circle around for countless eons.

source: དེ་ནས་དངོས་པོ་མེད་ཤེས་ན། །
en: “Therefore, if you know insubstantiality,

source: བུད་མེད་ཐམས་ཅད་མཚན་ཉིད་མེད། །
en: All women are without characteristics.

source: ཏིང་འཛིན་ཞི་བ་བརྗོད་པ་ནི། །བུད་མེད་གཟུགས་ཀྱིས་རབ་ཏུ་བསྟན། །
en: This statement on the peace of absorption I have made with reference to the female figure.

source: འཇམ་དཔལ་དེ་ལྟར་ན་བུད་མེད་ཀྱི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, that is how you should understand the female figure to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་སྐྱེས་པའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, how should bodhisattvas understand the male figure to be absorption?

source: འདི་ནི་བུད་མེད་བདག་སྐྱེས་པར། །ཇི་ལྟར་སྐྱེས་པས་བརྗོད་པ་ལས། །
en: “When men declare: ‘This is a woman and I am a man,’

source: དེ་ཡི་ཚེ་ན་དེ་ཡི་སེམས། །འདོད་ཆགས་ལྡན་པ་བརྫུན་པ་འབྱུང་། །
en: In that instant, their minds Become desirous and mistaken.

source: སེམས་ནི་གཟུགས་མེད་གཟུང་བ་མེད། །
en: “Yet mind is formless and imperceptible.

source: བུད་མེད་སྐྱེས་པར་བསྟན་པ་མེད། །
en: It is indemonstrable as woman or man.

source: ཀུན་ཏུ་རྟོག་པས་སྒྲོ་བཏགས་ནས། །
en: It is conceptual superimpositions

source: སྐྱེས་པའི་འདུ་ཤེས་འབྱུང་བར་འགྱུར། །
en: That give rise to the perception of man.

source: འདི་ནི་བུད་མེད་བདག་དཔའ་ཞེས། །འདུ་ཤེས་གང་གིས་རྣམ་བརྟགས་པ། །དེ་ངས་སྨིག་རྒྱུ་འདྲར་གསུངས་ཏེ། །
en: “Men declare: ‘This is a woman and I am a man.’ Yet all such imputed notions I have taught to be like a mirage,

source: དེ་ལ་སྐྱེས་པ་ཡོད་མ་ཡིན། །
en: And no man exists therein.

source: སྐྱེས་པ་ཉིད་ནི་བརྫུན་པས་ན། །
en: “Since the nature of man is illusory,

source: དེ་ནི་མེད་ལས་བྱུང་བ་ཡིན། །
en: He has arisen out of nonexistence.

source: ཏིང་འཛིན་ཞི་བ་བརྗོད་པ་ནི། །དཔའ་བོའི་གཟུགས་ཀྱིས་རབ་ཏུ་བསྟན། །
en: This statement on the peace of absorption I have made with reference to the male figure.

source: འཇམ་དཔལ་དེ་ལྟར་ན་སྐྱེས་པའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand the male figure to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་ཁྱེའུའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, how should bodhisattvas understand boys’ figures to be absorption?

source: ལྗོན་པའི་མྱུ་གུ་ཡོད་མིན་ན། །
en: “If there is no sapling,

source: མེ་ཏོག་འབྱུང་བར་ག་ལ་འགྱུར། །
en: How can a flower appear?

source: མེ་ཏོག་ཡོད་པ་མ་ཡིན་ན། །འབྲས་བུ་འཐོབ་པའང་མེད་པ་ལྟར། །
en: If there is no flower, The fruit cannot grow either.

source: བུད་མེད་ཡོད་པ་མ་ཡིན་པས། །ཁྱེའུ་ཡང་དམིགས་པར་མི་འགྱུར་ཏེ། །
en: “Likewise, since women are nonexistent, Boys cannot be apprehended either.

source: བརྟགས་པའི་དབང་དུ་སོང་རྣམས་ཀྱིས། །ཁྱེའུ་ཞེས་བྱ་བར་བཏགས་པ་ཡིན། །
en: Those who are under the sway of their imaginations, Falsely conceive what they call boy.

source: བུད་མེད་སྐྱེ་བ་མེད་ཤེས་ན། །ཁྱེའུ་ཡང་འབྱུང་བ་ཡོད་མིན་ཏེ། །
en: “If you know woman to be unborn, Boys have no origin either.

source: དངོས་པོ་ཐམས་ཅད་མེད་རྟོགས་པས། །དེས་ན་ཁྱེའུ་ནི་ཏིང་འཛིན་བསྟན། །
en: Realizing all entities to be nonexistent, I have taught boys to be absorption.

source: འཇམ་དཔལ་དེ་ལྟར་ན་ཁྱེའུའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand boys’ figures to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་བུ་མོའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན། །
en: “Mañjuśrī, how should bodhisattvas understand girls’ figures to be absorption?

source: ཇི་ལྟར་ཏ་ལའི་མགོ་བཅད་པ། །དེ་ནི་ནམ་ཡང་མི་སྐྱེ་སྟེ། །
en: “If a palm tree’s crown is cut off, It can never grow again.

source: མཁས་པས་ཤེས་ནས་དེ་ལ་ནི། །འབྲས་བུ་ཐོབ་པར་འདོད་པ་མེད། །
en: Knowing this, the wise Will not wish for any fruits to appear.

source: དེ་བཞིན་མཁས་པས་བུད་མེད་ཀྱང་། །རྣམ་ཀུན་སྐྱེ་བ་མེད་ཤེས་པས། །
en: “Likewise, once the wise know that women Have also never been born,

source: བརྟན་པ་བུ་མོ་སྐྱེས་སོ་ཞེས། །ཕྱིན་ཅད་རྟོག་པར་མི་བྱེད་དོ། །
en: They no longer wrongly think, ‘Their basis, a girl, has been born.’

source: ས་བོན་སྐམས་པར་གྱུར་པ་ལ། །རྣམ་ཀུན་སྐྱེ་བ་མེད་ཤེས་པས། །
en: “Knowing that when a seed is parched It can no longer grow,

source: ཏིང་འཛིན་ཞི་བ་བརྗོད་པ་ནི། །བུ་མོའི་གཟུགས་ཀྱིས་རབ་ཏུ་བསྟན། །
en: This statement on the peace of absorption I have made with reference to girls’ figures.

source: འཇམ་དཔལ་དེ་ལྟར་ན་བུ་མོའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand girls’ figures to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་ལྷའི་གཟུགས་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན། །
en: “Mañjuśrī, how should bodhisattvas understand gods’ figures to be absorption?

source: རྣམ་རྟོག་དགེ་ལས་བྱུང་བ་ཡི། །ལས་དགེའི་འབྲས་བུ་ལྷ་རྣམས་ཏེ། །
en: “Gods are the result of virtuous action Produced by virtuous thoughts.

source: རབ་ཏུ་དང་བའི་ཡིད་ཀྱིས་ནི། །མཛེས་པའི་ལྷ་རྣམས་མངོན་པར་གྲུབ། །
en: Pure minds cause The manifestation of beautiful gods.

source: གཞལ་མེད་ཁང་པ་ཉམས་དགའ་བ། །དེ་དག་གཞན་སུས་བྱས་པ་མིན། །
en: “Their delightful palaces Are not created by anyone else.

source: མེ་ཏོག་མན་དཱ་ར་བ་ཡང་། །དེ་དག་གཞན་སུས་བསྐྱེད་པ་མིན། །
en: The mandārava flower too Is not made by anyone else.

source: སྒྱུ་མའི་ལས་ལས་ཀུན་བྱུང་བས། །བྱུང་བ་རྣམས་ཀྱང་བསམ་དུ་མེད། །
en: “Produced by illusory action, These appearances are inconceivable.
